[
  {
    "_id": "1",
    "topic": "Star Wars",
    "title": "The Force Awakens",
    "userName": "Darth Vader",
    "avatar": "../images/vader.jpg",
    "handle": "skywalker",
    "time": "Jul 31",
    "tuit": "When I left you, I was but the learner. Now I am the master.\nSeveral transmissions were beamed to this ship by rebel spies.\nI want to know what happened to the plans they sent you.\nI told you she would never consciously betray the Rebellion.",
    "replies": 22,
    "retuits": 10,
    "likes": 37,
    "liked": false
  },
  {
    "_id": "2",
    "topic": "Star Wars",
    "title": "The Last Jedi",
    "userName": "Leia Organa",
    "avatar": "../images/leia.jpg",
    "handle": "leia_organa",
    "time": "May 4",
    "tuit": "Aren’t you a little short for a stormtrooper? Help me Obi-Wan Kenobi, you’re my only hope. We will not be silenced by the oppression of the Empire. Our resistance grows stronger with every passing day. We will fight for the freedom of our people and the restoration of justice in the galaxy. The rebellion will not falter, for hope and courage are the seeds of our victory.",
    "replies": 121,
    "retuits": 580,
    "likes": 1500,
    "liked": true
  },
  {
    "_id": "3",
    "topic": "Star Wars",
    "title": "The Empire Strikes Back",
    "userName": "Luke Skywalker",
    "avatar": "../images/luke.jpg",
    "handle": "luke_skywalker",
    "time": "May 2",
    "tuit": "I have a very bad feeling about this. The Force is strong with us, but we must learn to control it. We cannot give in to fear or anger, for they lead to the dark side. The path to becoming a Jedi is not an easy one, but it is a noble one. We must always be mindful of our actions and their consequences, and strive to use the Force for the greater good.",
    "replies": 236,
    "retuits": 197,
    "likes": 120,
    "liked": false
  },
  {
    "_id": "4",
    "topic": "Star Wars",
    "title": "A New Hope",
    "userName": "Han Solo",
    "avatar": "../images/han.jpg",
    "handle": "han_solo",
    "time": "Apr 25",
    "tuit": "Never tell me the odds! I've been around the galaxy a few times, and one thing I know for sure is that you can't trust anyone. But when you find people you can trust, you gotta stick with them. We may not be the most conventional group, but we've got each other's backs. And if anyone tries to mess with us, well...they'll regret it.",
    "replies": 27,
    "retuits": 240,
    "likes": 500,
    "liked": false
  },
  {
    "_id": "5",
    "topic": "Star Wars",
    "title": "Return of the Jedi",
    "userName": "Chewbacca",
    "avatar": "../images/chewie.jpg",
    "handle": "chewie",
    "time": "Apr 19",
    "tuit": "RRWWWGG RAWRGWAWGGRGRRR RR RRWWWGG RAWRGWAWGGRGRRR RRWWWGG RAWRGWAWGGRGRRR RR RRWWWGG RAWRGWAWGGRGRRR",
    "replies": 700,
    "retuits": 1456,
    "likes": 170,
    "liked": true
  },
  {
    "_id": "6",
    "topic": "Star Wars",
    "title": "The Phantom Menace",
    "userName": "C-3PO",
    "avatar": "../images/c3po.jpg",
    "handle": "c3po",
    "time": "Apr 15",
    "tuit": "I’m afraid I don’t understand, sir. Oh my! It seems we find ourselves in quite a predicament, doesn't it? But fear not, I am fluent in over six million forms of communication and will do my best to assist you. Although I must say, I do prefer situations that are a bit more... civilized. This is hardly the proper way for a protocol droid to conduct themselves.",
    "replies": 21,
    "retuits": 273,
    "likes": 975,
    "liked": false
  },
  {
    "_id": "7",
    "topic": "Star Wars",
    "title": "Attack of the Clones",
    "userName": "R2-D2",
    "avatar": "../images/r2d2.jpg",
    "handle": "r2d2",
    "time": "Apr 12",
    "tuit": "Beep boop beep boop. Translation: \"I may not be able to speak your language, but I am a loyal companion and always ready for an adventure. I have a variety of tools and abilities that can come in handy in any situation. And don't underestimate my bravery - I have faced some of the galaxy's most dangerous threats and always come out on top.\"",
    "replies": 1466,
    "retuits": 2906,
    "likes": 5458,
    "liked": true
  }
]